BackwardStep/Backward-Facing_reactingPimpleCentralFoam/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 55;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.09;
        value           uniform 55;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            omegaWallFunction;
        value           uniform 55;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    symwall
    {
        type            empty;
    }
}
// ************************************************************************* //
/*
mixingLength 0.09. Значение internalField — просто начальное приближение, реальное значение на входе считается из mixingLength и k. Пересчитываем: ω= ≈55
ixingLength 0.09 — оставлен без изменений
 * */
